STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "log_module.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble_core.h"
#include "uuid.h"
#include "ble_conf.h"
#include "svc_ctl.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "app_conf.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "adv_trace_usart_if.h"
#include "host_stack_if.h"
#include "app_bsp.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
typedef enum
{
  COC_START_TIMER_EVT,
  COC_STOP_TIMER_EVT,
  COC_NOTIFICATION_INFO_RECEIVED_EVT,
} COC_Client_Opcode_Notification_evt_t;

typedef struct
{
  uint8_t * pPayload;
  uint8_t     Length;
}COC_Client_Data_t;

typedef struct
{
  COC_Client_Opcode_Notification_evt_t  COC_Client_Evt_Opcode;
  COC_Client_Data_t DataTransfered;
}COC_Client_App_Notification_evt_t;

/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */

  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef enum
{
  SVC_ID_GAP = 0,
  SVC_ID_GATT,
  /* USER CODE BEGIN svcId_t */

  /* USER CODE END svcId_t */
  SVC_ID_MAX
}svcId_t;

typedef enum
{
  SVC_INFO_STATUS_EMPTY = 0,
  SVC_INFO_STATUS_FOUND,
  SVC_INFO_STATUS_DISCOVERED,
  SVC_INFO_STATUS_ERROR,
  /* USER CODE BEGIN svcInfoStatus_t */

  /* USER CODE END svcInfoStatus_t */
  SVC_INFO_STATUS_MAX
}svcInfoStatus_t;

typedef struct
{
  uint16_t uuid;

  uint16_t charStartHdl;
  uint16_t charEndHdl;
  uint16_t descStartHdl;
  uint16_t descEndHdl;

  uint16_t status;
  /* USER CODE BEGIN SvcInfo_t */

  /* USER CODE END SvcInfo_t */

}SvcInfo_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;

  APP_BLE_ConnStatus_t connStatus;
  uint16_t connHdl;

  SvcInfo_t svcInfo[SVC_ID_MAX];

  uint16_t ServiceChangedCharStartHdl;
  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;
  uint16_t ServiceChangedCharEndHdl;
  uint8_t ServiceChangedCharProperties;
  /* USER CODE BEGIN BleClientAppContext_t */

  /* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define BUFFUARTRX_SIZE   248
#define BUFFCOCTX_SIZE    BUFFUARTRX_SIZE

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

static BleClientAppContext_t a_ClientContext[BLE_CFG_CLT_MAX_NBR_CB];
static uint16_t gattCharStartHdl = 0;
static uint16_t gattCharValueHdl = 0;

/* USER CODE BEGIN PV */

static uint8_t a_buffUartRx[BUFFUARTRX_SIZE];
static uint8_t buffUartRxIndex;
static uint8_t a_buffCocTx[BUFFCOCTX_SIZE];
static uint8_t buffCocTxLen;

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
/* USER CODE BEGIN GV */
extern uint8_t charRx;
extern uint8_t real_time;

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event);
static void gatt_parse_services(aci_att_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_find_info_resp_event_rp0 *p_evt);
static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_all(void);
static void gatt_cmd_resp_release(void);
static void gatt_cmd_resp_wait(void);
/* USER CODE BEGIN PFP */

static void COC_Central_APP_Terminal_UART_RxCpltCallback( uint8_t *pdata, uint16_t size, uint8_t error);
static void RxUART_Init(void);
static void COC_CENTRAL_APP_Terminal_Init(void);
static void CentralSendData(void);

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  uint8_t index =0, svcIndex=0;
  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */

  /* USER CODE END GATT_CLIENT_APP_Init_1 */
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    a_ClientContext[index].connStatus = APP_BLE_IDLE;

    for(svcIndex = 0; svcIndex < SVC_ID_MAX; svcIndex++)
    {
      a_ClientContext[index].svcInfo[svcIndex].uuid = 0;
      a_ClientContext[index].svcInfo[svcIndex].charStartHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].charEndHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].descStartHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].descEndHdl = 0;
      a_ClientContext[index].svcInfo[svcIndex].status = SVC_INFO_STATUS_EMPTY;
      /* USER CODE BEGIN GATT_CLIENT_APP_Init_3 */

